/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: skamijo <skamijo@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/09/05 14:39:35 by skamijo           #+#    #+#             */
/*   Updated: 2024/09/22 22:29:44 by skamijo          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/**
 * @fn
 * 文字列strの長さを計算する。このとき、終端ヌルバイト ('\0') は計算に含まれない。
 * @param str ヌル終端文字列
 * @return 文字列 s のバイト数を返す。
 * @sa https://ja.manpages.org/strlen/3
 */
int	ft_strlen(char *s)
{
	int	count;

	count = 0;
	while (s[count] != '\0')
		count++;
	return (count);
}
